mina_parnian/week_05/day_02/mountains_app/app/controllers/mountains_controller.rb

  def create
    mountain = mountain.new
    mountain.name = params[:name]
    mountain.height = params[:place]
    mountain.image = params[:image]
    mountain.save
---
INSERT INTO "mountains" ("name", "height", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    mountain = Mountain.find params[:id]
    mountain.update :name => params[:name], :height => params[:height], :place => params[:place], :image => params[:image]
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "mountains" SET "image" = ?, "updated_at" = ? WHERE "mountains"."id" = ?  [["image", "http://cdn3-www.dogtime.com/assets/uploads/gallery/goldador-dog-breed-pictures/puppy-1.jpg"], ["updated_at", "2017-08-22 12:25:39.540852"], ["id", 11]]