mina_parnian/week_05/day_03/director-app/app/controllers/directors_controller.rb

  def create
    director = Director.create director_params
---
INSERT INTO "directors" ("name", "nationality", "dob", "years_active", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    director = Director.find params[:id]
    director.update director_params
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "directors" SET "image" = ?, "updated_at" = ? WHERE "directors"."id" = ?  [["image", "http://www.chinadaily.com.cn/world/images/attachement/jpg/site1/20160302/d8cb8a5155b01840833601.jpg"], ["updated_at", "2017-08-23 23:12:06.996316"], ["id", 7]]

  def edit
    @director = Director.find params[:id]
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @director = Director.find params[:id]
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    director = Director.find params[:id]
    director.destroy
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "directors" WHERE "directors"."id" = ?  [["id", 3]]