mina_parnian/week_05/day_03/director-app/app/controllers/movies_controller.rb

  def show
    @movie = Movie.find params[:id]
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]